CSI API ETABS v1
cPropFrame.GetColdZ Method
 Retrieves frame section property data for a cold formed Z-type frame section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetColdZ(
	string Name,
	ref string FileName,
	ref string MatProp,
	ref double T3,
	ref double T2,
	ref double Thickness,
	ref double Radius,
	ref double LipDepth,
	ref double LipAngle,
	ref int Color,
	ref string Notes,
	ref string GUID
)
Function GetColdZ (
	Name As String,
	ByRef FileName As String,
	ByRef MatProp As String,
	ByRef T3 As Double,
	ByRef T2 As Double,
	ByRef Thickness As Double,
	ByRef Radius As Double,
	ByRef LipDepth As Double,
	ByRef LipAngle As Double,
	ByRef Color As Integer,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim FileName As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim Thickness As Double
Dim Radius As Double
Dim LipDepth As Double
Dim LipAngle As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetColdZ(Name,
	FileName, MatProp, T3, T2, Thickness,
	Radius, LipDepth, LipAngle, Color,
	Notes, GUID)
int GetColdZ(
	String^ Name,
	String^% FileName,
	String^% MatProp,
	double% T3,
	double% T2,
	double% Thickness,
	double% Radius,
	double% LipDepth,
	double% LipAngle,
	int% Color,
	String^% Notes,
	String^% GUID
)
abstract GetColdZ :
        Name : string *
        FileName : string byref *
        MatProp : string byref *
        T3 : float byref *
        T2 : float byref *
        Thickness : float byref *
        Radius : float byref *
        LipDepth : float byref *
        LipAngle : float byref *
        Color : int byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing cold formed Z-type frame section property.
FileName
Type: System.String
 If the section property was imported from a property file, this is the name of that file. If the section property was not imported, this item is blank.
MatProp
Type: System.String
 The name of the material property for the section.
T3
Type: System.Double
 The section depth. [L]
T2
Type: System.Double
 The section width. [L]
Thickness
Type: System.Double
 The section thickness. [L]
Radius
Type: System.Double
 The corner radius, if any. [L]
LipDepth
Type: System.Double
 The lip depth, if any. [L]
LipAngle
Type: System.Double
 The lip angle measured from horizontal (0 <= LipAngle <= 90). [deg]
Color
Type: System.Int32
 The display color assigned to the section.
Notes
Type: System.String
 The notes, if any, assigned to the section.
GUID
Type: System.String
 The GUID (global unique identifier), if any, assigned to the section.
Return Value
Type: Int32
 returns zero if the section property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
 Please refer to GetColdZ_1(String, String, String, Double, Double, Double, Double, Double, Double, Boolean, Int32, String, String) which has additional parameters.
Examples
 Public Sub Example()
    Dim SapModel As cSapModel
     Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    Dim Name As String
    Dim FileName As String
    Dim MatProp As String
    Dim t3 As Double
    Dim t2 As Double
    Dim Thickness As Double
    Dim LipDepth As Double
    Dim LipAngle As Double
    Dim Radius As Double
    Dim Color As Integer
    Dim Notes As String
    Dim GUID As String
    'create ETABS object
        Dim myHelper as cHelper = New Helper
        EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
    'start ETABS application
        ret = EtabsObject.ApplicationStart()
    'create SapModel object
        SapModel = EtabsObject.SapModel
    'initialize model
        ret = SapModel.InitializeNewModel()
    'create steel deck template model
        ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
    'add cold formed material
        ret = SapModel.PropMaterial.AddQuick(Name, MATERIAL_COLDFORMED, , , , MATERIAL_COLDFORMED_SUBTYPE_ASTM_A653SQGr50)
    'set new frame section property
        ret = SapModel.PropFrame.SetColdZ("CZ1", Name, 10, 3.2, 0.08, 0.3, 0.6, 60)
    'get frame section property data
        ret = SapModel.PropFrame.GetColdZ("CZ1", FileName, MatProp, t3, t2, Thickness , Radius, LipDepth, LipAngle, Color, Notes, GUID)
   close ETABS
      EtabsObject.ApplicationExit(False_
      SapModel = Nothing
      EtabsObject = Nothing
End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace